# Ejercicio módulo 3

# Fase 1: Exploración y Limpieza 1

## 1. Exploración inicial

In [37]:
## Une los dos conjuntos de datos de la forma más eficiente.

In [45]:
import pandas as pd # Importamos Pandas
import numpy as np # Importamos Numpy
pd.set_option('display.max_columns', None) # Función para asegurar que se muestran todas las columnas al vistualizar los datos de los csv.

In [46]:
# Creamos el df para cada csv

df_flight= pd.read_csv('Customer Flight Activity.csv')
df_loyalty = pd.read_csv('Customer Loyalty History.csv')

In [47]:
# Consultamos columnas de cada df para ver cómo unir los 2 df y trabajar con un solo conjunto de datos.

print(df_flight.columns)
print(df_loyalty.columns)

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed'],
      dtype='object')
Index(['Loyalty Number', 'Country', 'Province', 'City', 'Postal Code',
       'Gender', 'Education', 'Salary', 'Marital Status', 'Loyalty Card',
       'CLV', 'Enrollment Type', 'Enrollment Year', 'Enrollment Month',
       'Cancellation Year', 'Cancellation Month'],
      dtype='object')

In [50]:
# Opción escogida: .merge() con 'inner' para quedarnos solo con los clientes comunes a los dos archivos. 

df_clients = df_flight.merge(df_loyalty, on='Loyalty Number', how='inner')

In [ ]:
## Realiza un EDA. Haz una exploración inicial de los datos para identificar posibles problemas, como valores nulos, atípicos o datos faltantes en las columnas relevantes.

In [22]:
df_clients.shape # Consultamos estructura del df: numero de filas x numero de columnas.

(405624, 25)

In [12]:
df_clients.head() # 5 primeras filas.

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,Canada,Ontario,Toronto,M1R 4K3,Male,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,Canada,British Columbia,Dawson Creek,U5I 4F1,Female,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,Canada,British Columbia,Vancouver,V5R 1W3,Male,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,Canada,Ontario,Toronto,P1L 8X8,Female,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN

In [15]:
df_clients.sample(5) # 5 filas aleatorias

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
256879,918341,2018,4,11,5,16,3856,415.8,0,0,Canada,Ontario,Kingston,M9K 2P4,Male,College,NaN,Divorced,Star,2659.71,Standard,2012,7,NaN,NaN
147748,844641,2017,8,18,8,26,4628,462.0,654,53,Canada,New Brunswick,Fredericton,E3B 2H2,Female,College,NaN,Single,Nova,4671.42,Standard,2016,1,NaN,NaN
174598,400181,2017,11,0,0,0,0,0.0,0,0,Canada,Quebec,Quebec City,G1B 3L5,Female,Bachelor,95276.0,Married,Star,2915.61,Standard,2018,7,NaN,NaN
54177,286065,2017,4,6,4,10,1820,182.0,0,0,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Married,Star,5504.14,Standard,2015,1,NaN,NaN
296721,601626,2018,6,20,0,20,2580,258.0,0,0,Canada,Nova Scotia,Halifax,B3J 9S2,Male,College,NaN,Married,Nova,8500.12,Standard,2016,8,NaN,NaN

In [17]:
df_clients.tail() #5 últimas filas. Nos permite comprobar que los 'loyalty number' no son correlativos y son diferentes al índice.

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
405619,999902,2018,12,0,0,0,0,0.0,0,0,Canada,Ontario,Toronto,M1R 4K3,Male,College,NaN,Married,Aurora,7290.07,Standard,2014,5,NaN,NaN
405620,999911,2018,12,0,0,0,0,0.0,0,0,Canada,Newfoundland,St. John's,A1C 6H9,Male,Doctor,217943.0,Single,Nova,8564.77,Standard,2012,8,NaN,NaN
405621,999940,2018,12,3,0,3,1233,123.0,0,0,Canada,Quebec,Quebec City,G1B 3L5,Female,Bachelor,47670.0,Married,Nova,20266.50,Standard,2017,7,NaN,NaN
405622,999982,2018,12,0,0,0,0,0.0,0,0,Canada,British Columbia,Victoria,V10 6T5,Male,College,NaN,Married,Star,2631.56,Standard,2018,7,NaN,NaN
405623,999986,2018,12,0,0,0,0,0.0,0,0,Canada,Ontario,Ottawa,K1F 2R2,Female,Bachelor,46594.0,Married,Nova,8257.01,2018 Promotion,2018,2,NaN,NaN

In [ ]:
df_clients.info() # Consultamos información sobre el nombre de las columnas, tipo de datos y presencia de valores nulos.

# No se observan columnas repetidas.

# Tipos de datos:
# - 'Points Accumulated': tiene sentido que sea float o podría ser integer?
# - 'Postal Code': normalmente no tienen letras. Podría ser int?
# - 'Loyalty Card': qué tipo de valor tiene? Podría ser un booleano?

# Columnas con información de mes y año: deberían ser int. Las necesitaremos todas?

# Nulos o datos faltantes:
# - 'Salary': tiene bastantes 10.000 aprox.). Aún por determinar si son demasiados.
# - Columnas con información sobre cancelación: tienen un número elevado de nulos/ falta de datos.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 25 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
 10  Country                      405624 non-null  object
 11  Province                     405624 non-null  object
 12  City                         405624 non-null  object
 13  Postal Code                  405624 non-null  object
 14  Gender                       405624 non-null  object
 15  Education                    405624 non-null  object
 16  Salary                       302952 non-null  float64
 17  Marital Status               405624 non-null  object
 18  Loyalty Card                 405624 non-null  object
 19  CLV                          405624 non-null  float64
 20  Enrollment Type              405624 non-null  object
 21  Enrollment Year              405624 non-null  int64
 22  Enrollment Month             405624 non-null  int64
 23  Cancellation Year            50064 non-null   float64
 24  Cancellation Month           50064 non-null   float64
dtypes: float64(5), int64(11), object(9)
memory usage: 77.4+ MB

In [ ]:
df_clients.columns # Consultamos qué columnas tiene el df. No es imprescindible porque ya las vemos con .info(), pero es más cómodo porque el resultado ocupa menos espacio.

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed',
       'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [24]:
df_clients.dtypes # Volvemos a consultar el tipo de datos de cada columna. Igual que en .columns, vemos la información en .info(), pero dtypes es más conciso.

Loyalty Number                   int64
Year                             int64
Month                            int64
Flights Booked                   int64
Flights with Companions          int64
Total Flights                    int64
Distance                         int64
Points Accumulated             float64
Points Redeemed                  int64
Dollar Cost Points Redeemed      int64
Country                         object
Province                        object
City                            object
Postal Code                     object
Gender                          object
Education                       object
Salary                         float64
Marital Status                  object
Loyalty Card                    object
CLV                            float64
Enrollment Type                 object
Enrollment Year                  int64
Enrollment Month                 int64
Cancellation Year              float64
Cancellation Month             float64
dtype: object

In [65]:
# Consultamos los datos según tipo de columna (numérica o categórica):

# Numérica tipo integer:
df_clients.select_dtypes(include=[int])

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Redeemed,Dollar Cost Points Redeemed,Enrollment Year,Enrollment Month
0,100018,2017,1,3,0,3,1521,0,0,2016,8
1,100102,2017,1,10,4,14,2030,0,0,2013,3
2,100140,2017,1,6,0,6,1200,0,0,2016,7
3,100214,2017,1,0,0,0,0,0,0,2015,8
4,100272,2017,1,0,0,0,0,0,0,2014,1
...,...,...,...,...,...,...,...,...,...,...,...
405619,999902,2018,12,0,0,0,0,0,0,2014,5
405620,999911,2018,12,0,0,0,0,0,0,2012,8
405621,999940,2018,12,3,0,3,1233,0,0,2017,7
405622,999982,2018,12,0,0,0,0,0,0,2018,7
405623,999986,2018,12,0,0,0,0,0,0,2018,2

In [ ]:
# No parece haber valores atípicos. Aun así, comprobamos que no haya valores atípicos en los meses:
df_clients['Enrollment Month'].unique()

array([ 8,  3,  7,  1,  9,  5, 10,  2,  4,  6, 11, 12])

In [63]:
df_clients['Month'].unique()

array([ 1,  9,  2,  3, 11,  4,  5,  7,  6,  8, 10, 12])

In [ ]:
# Numérica tipo float:
df_clients.select_dtypes(include=[float])

# Ver observaciones sobre tipo de datos en líneas de código anteriores.
# Vemos como 'Salary' es float pero el decimal siempre es 0. Debería ser int.

,Points Accumulated,Salary,CLV,Cancellation Year,Cancellation Month
0,152.0,92552.0,7919.20,NaN,NaN
1,203.0,NaN,2887.74,NaN,NaN
2,120.0,NaN,2838.07,NaN,NaN
3,0.0,63253.0,4170.57,NaN,NaN
4,0.0,91163.0,6622.05,NaN,NaN
...,...,...,...,...,...
405619,0.0,NaN,7290.07,NaN,NaN
405620,0.0,217943.0,8564.77,NaN,NaN
405621,123.0,47670.0,20266.50,NaN,NaN
405622,0.0,NaN,2631.56,NaN,NaN
405623,0.0,46594.0,8257.01,NaN,NaN

In [ ]:
# Comprobamos 'Salary', que trataremos en el ejercicio 2:

df_clients['Salary'].sample(10)

319866    97408.0
311752        NaN
137722    72459.0
13188     95864.0
375332    76260.0
67998     97240.0
387553        NaN
143924    62202.0
192488        NaN
336168    84147.0
Name: Salary, dtype: float64

In [73]:
# También observamos como 'Cancellation Year' y 'Cancellation Month' están vacías. Lo comprobamos con muestra aleatoria de observaciones:
df_clients['Cancellation Year'].sample(10)

72390        NaN
270000       NaN
6378         NaN
377360       NaN
404750    2017.0
104841       NaN
175502       NaN
378571       NaN
133053       NaN
266919       NaN
Name: Cancellation Year, dtype: float64

In [74]:
df_clients['Cancellation Month'].sample(10)

62227     NaN
341397    NaN
163285    NaN
32998     NaN
109603    NaN
285743    NaN
212758    NaN
285818    NaN
41350     1.0
183502    NaN
Name: Cancellation Month, dtype: float64

In [ ]:
# Columnas categóricas:
df_clients.select_dtypes(include=["O"])

# Comprobamos como el código postal incluye letras, así que no puede ser int y tendrá que mantenerse en string (object).

,Country,Province,City,Postal Code,Gender,Education,Marital Status,Loyalty Card,Enrollment Type
0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,Married,Aurora,Standard
1,Canada,Ontario,Toronto,M1R 4K3,Male,College,Single,Nova,Standard
2,Canada,British Columbia,Dawson Creek,U5I 4F1,Female,College,Divorced,Nova,Standard
3,Canada,British Columbia,Vancouver,V5R 1W3,Male,Bachelor,Married,Star,Standard
4,Canada,Ontario,Toronto,P1L 8X8,Female,Bachelor,Divorced,Star,Standard
...,...,...,...,...,...,...,...,...,...
405619,Canada,Ontario,Toronto,M1R 4K3,Male,College,Married,Aurora,Standard
405620,Canada,Newfoundland,St. John's,A1C 6H9,Male,Doctor,Single,Nova,Standard
405621,Canada,Quebec,Quebec City,G1B 3L5,Female,Bachelor,Married,Nova,Standard
405622,Canada,British Columbia,Victoria,V10 6T5,Male,College,Married,Star,Standard
405623,Canada,Ontario,Ottawa,K1F 2R2,Female,Bachelor,Married,Nova,2018 Promotion

In [94]:
# Podría ser que algunas columnas como 'Country' o 'Enrollment Type' no tuvieran más que 1 valor. Lo miramos:

df_clients.describe(include = 'object').T

                  count unique       top    freq
Country          405624      1    Canada  405624
Province         405624     11   Ontario  130896
City             405624     29   Toronto   81096
Postal Code      405624     55   V6E 3D9   21984
Gender           405624      2    Female  203640
Education        405624      5  Bachelor  253752
Marital Status   405624      3   Married  235800
Loyalty Card     405624      3      Star  184224
Enrollment Type  405624      2  Standard  382200

In [95]:
# ELIMINAR COLUMNAS INNECESARIAS --> PENDIENTE

In [96]:
# En 'Enrollment Type', al solo ver 'Standard', miramos si hay varios valores por cada tipología, por si hubiera que eliminar una que no tenga valores.

mask_enrollment = df_clients['Enrollment Type']
df_clients['Enrollment Type'].value_counts()

Enrollment Type
Standard          382200
2018 Promotion     23424
Name: count, dtype: int64

In [ ]:
# Ahora consultamos las estadísticas básicas para todos los típos de columnas:

df_clients.describe().T

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,405624.0,550037.873084,258935.286969,100018.00,326961.00,550834.00,772194.00,999986.00
Year,405624.0,2017.500000,0.500001,2017.00,2017.00,2017.50,2018.00,2018.00
Month,405624.0,6.500000,3.452057,1.00,3.75,6.50,9.25,12.00
Flights Booked,405624.0,4.115052,5.225518,0.00,0.00,1.00,8.00,21.00
Flights with Companions,405624.0,1.031805,2.076869,0.00,0.00,0.00,1.00,11.00
Total Flights,405624.0,5.146858,6.521227,0.00,0.00,1.00,10.00,32.00
Distance,405624.0,1208.880059,1433.155320,0.00,0.00,488.00,2336.00,6293.00
Points Accumulated,405624.0,123.692721,146.599831,0.00,0.00,50.00,239.00,676.50
Points Redeemed,405624.0,30.696872,125.486049,0.00,0.00,0.00,0.00,876.00
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.00,0.00,0.00,0.00,71.00
Salary,302952.0,79268.825953,34992.133508,-58486.00,59262.00,73479.00,88612.00,407228.00
CLV,405624.0,7991.976226,6863.663857,1898.01,3985.32,5776.34,8936.82,83325.38
Enrollment Year,405624.0,2015.252529,1.979427,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,405624.0,6.668008,3.399766,1.00,4.00,7.00,10.00,12.00
Cancellation Year,50064.0,2016.499521,1.384336,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,50064.0,6.966443,3.448300,1.00,4.00,7.00,10.00,12.00

In [ ]:
'''Orden que podríamos seguir (de momento):
-Veo la tabla
-Consulto info
-Qué columnas tiene
-Consulto tipo de dato de cada columna
-Descripción de columnas numéricas
-Descripción de columnas categóricas
-Valores únicos en columnas categóricas
-Nulos
-Duplicados
-¿Borrar duplicados?
-¿Borrar columnas?
-¿Crear columna nueva?'''

In [ ]:
# Hay columnas con solo 1 valor?

df_comun.columns[df_comun.nunique() == 1]

In [99]:
# Hay nulos?

df_clients.isnull().sum()

Loyalty Number                      0
Year                                0
Month                               0
Flights Booked                      0
Flights with Companions             0
Total Flights                       0
Distance                            0
Points Accumulated                  0
Points Redeemed                     0
Dollar Cost Points Redeemed         0
Country                             0
Province                            0
City                                0
Postal Code                         0
Gender                              0
Education                           0
Salary                         102672
Marital Status                      0
Loyalty Card                        0
CLV                                 0
Enrollment Type                     0
Enrollment Year                     0
Enrollment Month                    0
Cancellation Year              355560
Cancellation Month             355560
dtype: int64

In [100]:
# Hay duplicados?

df_clients.duplicated().sum()

np.int64(1864)

In [ ]:
## PENDIENTE:

# -¿Borrar duplicados?
-¿Borrar columnas?